----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 128, 128]             896
       BatchNorm2d-2         [-1, 32, 128, 128]              64
              ReLU-3         [-1, 32, 128, 128]               0
            Conv2d-4         [-1, 32, 126, 126]           9,248
       BatchNorm2d-5         [-1, 32, 126, 126]              64
              ReLU-6         [-1, 32, 126, 126]               0
         MaxPool2d-7           [-1, 32, 63, 63]               0
            Conv2d-8           [-1, 64, 61, 61]          18,496
       BatchNorm2d-9           [-1, 64, 61, 61]             128
             ReLU-10           [-1, 64, 61, 61]               0
        MaxPool2d-11           [-1, 64, 30, 30]               0
           Conv2d-12           [-1, 64, 30, 30]             640
      BatchNorm2d-13           [-1, 64, 30, 30]             128
            ReLU6-14           [-1, 64, 30, 30]               0
           Conv2d-15           [-1, 64, 30, 30]           4,160
        MaxPool2d-16           [-1, 64, 15, 15]               0
           Conv2d-17           [-1, 64, 15, 15]             640
      BatchNorm2d-18           [-1, 64, 15, 15]             128
            ReLU6-19           [-1, 64, 15, 15]               0
           Conv2d-20          [-1, 128, 15, 15]           8,320
        MaxPool2d-21            [-1, 128, 7, 7]               0
           Conv2d-22            [-1, 128, 7, 7]           1,280
      BatchNorm2d-23            [-1, 128, 7, 7]             256
            ReLU6-24            [-1, 128, 7, 7]               0
           Conv2d-25            [-1, 128, 7, 7]          16,512
           Conv2d-26            [-1, 128, 7, 7]           1,280
      BatchNorm2d-27            [-1, 128, 7, 7]             256
            ReLU6-28            [-1, 128, 7, 7]               0
           Conv2d-29            [-1, 256, 7, 7]          33,024
AdaptiveAvgPool2d-30            [-1, 256, 1, 1]               0
           Linear-31                   [-1, 11]           2,827
================================================================
Total params: 98,347
Trainable params: 98,347
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 33.38
Params size (MB): 0.38
Estimated Total Size (MB): 33.95
----------------------------------------------------------------